// [The Sum of elements]
// Сумма элементов
//
// Дан вектор целочисленных значений. Необходимо разработать
// функцию(или программу), которая вычисляет сумму элементов
// вектора, расположенных между первым и последним нулевыми
// элементами. Если вектор содержит только один нулевой элемент
// или не содержит вообще нулевых элементов, а также, если
// вектор задан некорректно, то функция(программа) должна
// возвратить ноль.

#include "logic.h"

int sum_elements(int* array, int size) {
	return -1;
}